/**
******************************************************************************
* 文件：    		bsp.c
* 描述：			  硬件驱动代码
*	说明:         硬件驱动初始化
* 作者：		    
* 版本： 			  V1.0
* 时间：    		2020/7/28
******************************************************************************
*/
#include "bsp.h"
#include "usart1.h"	  
#include "myiic.h"
/*
*********************************************************************************************************
*	函 数 名: bsp_Init
*	功能说明: 初始化硬件设备。只需要调用一次。该函数配置CPU寄存器和外设的寄存器并初始化一些全局变量。
*			 全局变量。
*	形    参：无
*	返 回 值: 无
*********************************************************************************************************
*/
void bsp_Init(void)
{
	  /* 优先级分组设置为4 */
	  NVIC_PriorityGroupConfig(NVIC_PriorityGroup_4);//设置中断优先级分组为组4：4位抢占优先级，0位响应优先级 
//	  USART1_Config();
	  vUart1_Init();
	  vUart2_Init();
	  delay_init();	//延时初始化 
	  delay_ms(1000); 
	  USART3_Config();
	  vAllOutputPinInit();
	  vAll_EXTI_PinInit();
	  vALL_TIM_Init();
	  vAll_TIM_CaptureInit();
	  vIIC_Init();
}
